TESTRUN1-HOST0/fio-benchmark-output/Test07-Typeread-BS8k-DeviceCount07.txt
test1-subtest1-blocksize8k-threads1-device1of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device2of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device3of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device4of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device5of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device6of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest1-blocksize8k-threads1-device7of7: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
test1-subtest2-blocksize8k-threads2-device1of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device2of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device3of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device4of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device5of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device6of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize8k-threads2-device7of7: (g=1): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device1of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device2of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device3of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device4of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device5of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device6of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize8k-threads3-device7of7: (g=2): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device1of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device2of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device3of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device4of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device5of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device6of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize8k-threads4-device7of7: (g=3): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device1of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device2of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device3of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device4of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device5of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device6of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize8k-threads5-device7of7: (g=4): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device1of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device2of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device3of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device4of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device5of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device6of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize8k-threads6-device7of7: (g=5): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device1of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device2of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device3of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device4of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device5of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device6of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize8k-threads7-device7of7: (g=6): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device1of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device2of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device3of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device4of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device5of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device6of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize8k-threads8-device7of7: (g=7): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device1of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device2of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device3of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device4of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device5of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device6of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize8k-threads9-device7of7: (g=8): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device1of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device2of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device3of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device4of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device5of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device6of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize8k-threads10-device7of7: (g=9): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.12
Starting 385 processes

test1-subtest1-blocksize8k-threads1-device1of7: (groupid=0, jobs=7): err= 0: pid=39707: Sat Jan 12 03:45:45 2019
  read: IOPS=26.1k, BW=204MiB/s (213MB/s)(11.9GiB/60005msec)
    slat (nsec): min=2415, max=19181, avg=3095.85, stdev=507.73
    clat (usec): min=62, max=15257, avg=265.03, stdev=133.07
     lat (usec): min=66, max=15261, avg=268.18, stdev=133.08
    clat percentiles (usec):
     |  1.00th=[   72],  5.00th=[   75], 10.00th=[   86], 20.00th=[  129],
     | 30.00th=[  180], 40.00th=[  247], 50.00th=[  297], 60.00th=[  330],
     | 70.00th=[  351], 80.00th=[  367], 90.00th=[  396], 95.00th=[  420],
     | 99.00th=[  453], 99.50th=[  474], 99.90th=[  594], 99.95th=[ 1012],
     | 99.99th=[ 3261]
   bw (  KiB/s): min=191261, max=227777, per=99.78%, avg=207974.23, stdev=1331.30, samples=834
   iops        : min=23904, max=28471, avg=25993.36, stdev=166.43, samples=834
  lat (usec)   : 100=12.95%, 250=27.73%, 500=59.05%, 750=0.21%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=0.27%, sys=1.63%, ctx=1563397, majf=0, minf=110
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1563362,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest2-blocksize8k-threads2-device1of7: (groupid=1, jobs=14): err= 0: pid=40028: Sat Jan 12 03:45:45 2019
  read: IOPS=47.4k, BW=370MiB/s (388MB/s)(21.7GiB/60002msec)
    slat (nsec): min=1991, max=30752, avg=3193.51, stdev=531.26
    clat (usec): min=62, max=48851, avg=291.71, stdev=140.86
     lat (usec): min=69, max=48855, avg=294.96, stdev=140.88
    clat percentiles (usec):
     |  1.00th=[   88],  5.00th=[  122], 10.00th=[  135], 20.00th=[  165],
     | 30.00th=[  212], 40.00th=[  255], 50.00th=[  293], 60.00th=[  330],
     | 70.00th=[  359], 80.00th=[  392], 90.00th=[  416], 95.00th=[  498],
     | 99.00th=[  627], 99.50th=[  693], 99.90th=[  799], 99.95th=[ 1139],
     | 99.99th=[ 3654]
   bw (  KiB/s): min=344399, max=402585, per=96.12%, avg=364405.02, stdev=739.99, samples=1666
   iops        : min=43046, max=50317, avg=45543.71, stdev=92.49, samples=1666
  lat (usec)   : 100=2.98%, 250=34.97%, 500=57.77%, 750=4.08%, 1000=0.14%
  lat (msec)   : 2=0.03%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  cpu          : usr=0.30%, sys=1.46%, ctx=2844141, majf=0, minf=220
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2843330,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest3-blocksize8k-threads3-device1of7: (groupid=2, jobs=21): err= 0: pid=40240: Sat Jan 12 03:45:45 2019
  read: IOPS=66.1k, BW=517MiB/s (542MB/s)(30.3GiB/60001msec)
    slat (nsec): min=1987, max=65439, avg=3711.91, stdev=1061.53
    clat (usec): min=60, max=92363, avg=313.34, stdev=182.93
     lat (usec): min=71, max=92367, avg=317.10, stdev=183.00
    clat percentiles (usec):
     |  1.00th=[  111],  5.00th=[  145], 10.00th=[  167], 20.00th=[  196],
     | 30.00th=[  221], 40.00th=[  249], 50.00th=[  293], 60.00th=[  338],
     | 70.00th=[  375], 80.00th=[  404], 90.00th=[  482], 95.00th=[  578],
     | 99.00th=[  709], 99.50th=[  775], 99.90th=[  963], 99.95th=[ 1221],
     | 99.99th=[ 3884]
   bw (  KiB/s): min=490892, max=555844, per=99.78%, avg=527743.86, stdev=514.87, samples=2499
   iops        : min=61353, max=69474, avg=65961.26, stdev=64.34, samples=2499
  lat (usec)   : 100=0.56%, 250=39.71%, 500=50.86%, 750=8.20%, 1000=0.59%
  lat (msec)   : 2=0.05%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.31%, sys=1.70%, ctx=3973360, majf=0, minf=322
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3967001,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest4-blocksize8k-threads4-device1of7: (groupid=3, jobs=28): err= 0: pid=40568: Sat Jan 12 03:45:45 2019
  read: IOPS=85.6k, BW=669MiB/s (701MB/s)(39.2GiB/60002msec)
    slat (nsec): min=1994, max=96214, avg=4052.98, stdev=1346.07
    clat (usec): min=63, max=86481, avg=322.47, stdev=177.00
     lat (usec): min=69, max=86484, avg=326.58, stdev=177.02
    clat percentiles (usec):
     |  1.00th=[  145],  5.00th=[  174], 10.00th=[  190], 20.00th=[  200],
     | 30.00th=[  221], 40.00th=[  262], 50.00th=[  302], 60.00th=[  343],
     | 70.00th=[  379], 80.00th=[  400], 90.00th=[  494], 95.00th=[  586],
     | 99.00th=[  758], 99.50th=[  799], 99.90th=[ 1037], 99.95th=[ 1401],
     | 99.99th=[ 5014]
   bw (  KiB/s): min=643782, max=720393, per=99.77%, avg=683196.34, stdev=478.90, samples=3332
   iops        : min=80464, max=90033, avg=85389.13, stdev=59.76, samples=3332
  lat (usec)   : 100=0.11%, 250=37.62%, 500=52.63%, 750=8.59%, 1000=0.93%
  lat (msec)   : 2=0.08%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.34%, sys=1.76%, ctx=5148831, majf=0, minf=432
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=5135704,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest5-blocksize8k-threads5-device1of7: (groupid=4, jobs=35): err= 0: pid=40877: Sat Jan 12 03:45:45 2019
  read: IOPS=104k, BW=816MiB/s (856MB/s)(47.8GiB/60002msec)
    slat (nsec): min=1961, max=106133, avg=4273.01, stdev=1604.16
    clat (usec): min=45, max=89117, avg=330.03, stdev=189.14
     lat (usec): min=65, max=89120, avg=334.36, stdev=189.18
    clat percentiles (usec):
     |  1.00th=[  118],  5.00th=[  174], 10.00th=[  192], 20.00th=[  215],
     | 30.00th=[  241], 40.00th=[  277], 50.00th=[  310], 60.00th=[  347],
     | 70.00th=[  379], 80.00th=[  400], 90.00th=[  498], 95.00th=[  594],
     | 99.00th=[  775], 99.50th=[  840], 99.90th=[ 1123], 99.95th=[ 1385],
     | 99.99th=[ 4293]
   bw (  KiB/s): min=776988, max=887005, per=99.78%, avg=834121.35, stdev=551.35, samples=4165
   iops        : min=97107, max=110858, avg=104256.46, stdev=68.91, samples=4165
  lat (usec)   : 50=0.01%, 100=0.74%, 250=31.48%, 500=57.85%, 750=8.51%
  lat (usec)   : 1000=1.25%
  lat (msec)   : 2=0.14%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.38%, sys=1.78%, ctx=6290896, majf=0, minf=555
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6269931,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest6-blocksize8k-threads6-device1of7: (groupid=5, jobs=42): err= 0: pid=41141: Sat Jan 12 03:45:45 2019
  read: IOPS=125k, BW=976MiB/s (1023MB/s)(57.2GiB/60002msec)
    slat (nsec): min=1976, max=115022, avg=4452.14, stdev=1767.64
    clat (usec): min=40, max=99202, avg=331.08, stdev=191.13
     lat (usec): min=65, max=99205, avg=335.59, stdev=191.15
    clat percentiles (usec):
     |  1.00th=[   89],  5.00th=[  169], 10.00th=[  192], 20.00th=[  215],
     | 30.00th=[  249], 40.00th=[  285], 50.00th=[  318], 60.00th=[  355],
     | 70.00th=[  383], 80.00th=[  400], 90.00th=[  474], 95.00th=[  594],
     | 99.00th=[  783], 99.50th=[  857], 99.90th=[ 1172], 99.95th=[ 1434],
     | 99.99th=[ 4146]
   bw (  KiB/s): min=916062, max=1055919, per=99.77%, avg=997112.06, stdev=580.40, samples=4998
   iops        : min=114488, max=131959, avg=124627.34, stdev=72.55, samples=4998
  lat (usec)   : 50=0.01%, 100=1.64%, 250=28.73%, 500=60.46%, 750=7.51%
  lat (usec)   : 1000=1.44%
  lat (msec)   : 2=0.19%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.42%, sys=1.82%, ctx=7530651, majf=0, minf=668
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=7496093,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest7-blocksize8k-threads7-device1of7: (groupid=6, jobs=49): err= 0: pid=41500: Sat Jan 12 03:45:45 2019
  read: IOPS=147k, BW=1151MiB/s (1206MB/s)(67.4GiB/60003msec)
    slat (nsec): min=1894, max=105181, avg=4643.11, stdev=1991.98
    clat (usec): min=5, max=99278, avg=327.38, stdev=190.61
     lat (usec): min=64, max=99283, avg=332.08, stdev=190.62
    clat percentiles (usec):
     |  1.00th=[   80],  5.00th=[  105], 10.00th=[  167], 20.00th=[  210],
     | 30.00th=[  251], 40.00th=[  289], 50.00th=[  322], 60.00th=[  359],
     | 70.00th=[  388], 80.00th=[  404], 90.00th=[  445], 95.00th=[  594],
     | 99.00th=[  783], 99.50th=[  848], 99.90th=[ 1205], 99.95th=[ 1565],
     | 99.99th=[ 4424]
   bw (  MiB/s): min= 1056, max= 1225, per=99.80%, avg=1148.25, stdev= 0.58, samples=5832
   iops        : min=135239, max=156796, avg=146965.12, stdev=73.66, samples=5832
  lat (usec)   : 10=0.01%, 50=0.01%, 100=4.47%, 250=25.16%, 500=62.22%
  lat (usec)   : 750=6.37%, 1000=1.54%
  lat (msec)   : 2=0.21%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.46%, sys=1.88%, ctx=8895370, majf=0, minf=779
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8836856,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest8-blocksize8k-threads8-device1of7: (groupid=7, jobs=56): err= 0: pid=41793: Sat Jan 12 03:45:45 2019
  read: IOPS=171k, BW=1337MiB/s (1402MB/s)(78.3GiB/60003msec)
    slat (nsec): min=1974, max=119773, avg=4823.29, stdev=2203.71
    clat (usec): min=6, max=93356, avg=321.73, stdev=200.18
     lat (usec): min=62, max=93362, avg=326.61, stdev=200.22
    clat percentiles (usec):
     |  1.00th=[   79],  5.00th=[   92], 10.00th=[  122], 20.00th=[  194],
     | 30.00th=[  247], 40.00th=[  289], 50.00th=[  326], 60.00th=[  367],
     | 70.00th=[  388], 80.00th=[  404], 90.00th=[  441], 95.00th=[  586],
     | 99.00th=[  791], 99.50th=[  824], 99.90th=[ 1205], 99.95th=[ 1565],
     | 99.99th=[ 4490]
   bw (  MiB/s): min= 1221, max= 1425, per=99.83%, avg=1334.58, stdev= 0.68, samples=6665
   iops        : min=156295, max=182456, avg=170811.05, stdev=87.66, samples=6665
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=7.28%, 250=23.17%
  lat (usec)   : 500=62.38%, 750=5.20%, 1000=1.72%
  lat (msec)   : 2=0.22%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.52%, sys=1.96%, ctx=10362983, majf=0, minf=895
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10267413,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest9-blocksize8k-threads9-device1of7: (groupid=8, jobs=63): err= 0: pid=42108: Sat Jan 12 03:45:45 2019
  read: IOPS=199k, BW=1554MiB/s (1630MB/s)(91.1GiB/60003msec)
    slat (nsec): min=1993, max=141854, avg=4945.46, stdev=2374.26
    clat (nsec): min=703, max=100396k, avg=311013.07, stdev=205730.11
     lat (usec): min=61, max=100402, avg=316.02, stdev=205.80
    clat percentiles (usec):
     |  1.00th=[   77],  5.00th=[   88], 10.00th=[   99], 20.00th=[  149],
     | 30.00th=[  227], 40.00th=[  285], 50.00th=[  330], 60.00th=[  367],
     | 70.00th=[  388], 80.00th=[  404], 90.00th=[  437], 95.00th=[  570],
     | 99.00th=[  783], 99.50th=[  816], 99.90th=[ 1205], 99.95th=[ 1549],
     | 99.99th=[ 4424]
   bw (  MiB/s): min= 1427, max= 1652, per=99.79%, avg=1550.90, stdev= 0.72, samples=7498
   iops        : min=182653, max=211508, avg=198493.48, stdev=92.13, samples=7498
  lat (nsec)   : 750=0.01%
  lat (usec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=10.47%, 250=22.89%
  lat (usec)   : 500=60.43%, 750=4.23%, 1000=1.75%
  lat (msec)   : 2=0.21%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.58%, sys=2.05%, ctx=12082490, majf=0, minf=1008
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11936057,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest10-blocksize8k-threads10-device1of7: (groupid=9, jobs=70): err= 0: pid=42486: Sat Jan 12 03:45:45 2019
  read: IOPS=228k, BW=1779MiB/s (1866MB/s)(104GiB/60003msec)
    slat (nsec): min=1993, max=169588, avg=5070.06, stdev=2509.10
    clat (nsec): min=683, max=98379k, avg=301546.27, stdev=198542.27
     lat (usec): min=58, max=98382, avg=306.68, stdev=198.62
    clat percentiles (usec):
     |  1.00th=[   78],  5.00th=[   87], 10.00th=[   96], 20.00th=[  135],
     | 30.00th=[  169], 40.00th=[  269], 50.00th=[  322], 60.00th=[  367],
     | 70.00th=[  392], 80.00th=[  404], 90.00th=[  437], 95.00th=[  562],
     | 99.00th=[  791], 99.50th=[  816], 99.90th=[ 1221], 99.95th=[ 1598],
     | 99.99th=[ 4359]
   bw (  MiB/s): min= 1620, max= 1918, per=99.99%, avg=1778.96, stdev= 0.77, samples=8373
   iops        : min=207484, max=245602, avg=227705.83, stdev=98.83, samples=8373
  lat (nsec)   : 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=12.02%
  lat (usec)   : 250=25.56%, 500=56.50%, 750=3.84%, 1000=1.85%
  lat (msec)   : 2=0.21%, 4=0.02%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.65%, sys=2.14%, ctx=13855712, majf=0, minf=1072
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=13664146,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=204MiB/s (213MB/s), 204MiB/s-204MiB/s (213MB/s-213MB/s), io=11.9GiB (12.8GB), run=60005-60005msec

Run status group 1 (all jobs):
   READ: bw=370MiB/s (388MB/s), 370MiB/s-370MiB/s (388MB/s-388MB/s), io=21.7GiB (23.3GB), run=60002-60002msec

Run status group 2 (all jobs):
   READ: bw=517MiB/s (542MB/s), 517MiB/s-517MiB/s (542MB/s-542MB/s), io=30.3GiB (32.5GB), run=60001-60001msec

Run status group 3 (all jobs):
   READ: bw=669MiB/s (701MB/s), 669MiB/s-669MiB/s (701MB/s-701MB/s), io=39.2GiB (42.1GB), run=60002-60002msec

Run status group 4 (all jobs):
   READ: bw=816MiB/s (856MB/s), 816MiB/s-816MiB/s (856MB/s-856MB/s), io=47.8GiB (51.4GB), run=60002-60002msec

Run status group 5 (all jobs):
   READ: bw=976MiB/s (1023MB/s), 976MiB/s-976MiB/s (1023MB/s-1023MB/s), io=57.2GiB (61.4GB), run=60002-60002msec

Run status group 6 (all jobs):
   READ: bw=1151MiB/s (1206MB/s), 1151MiB/s-1151MiB/s (1206MB/s-1206MB/s), io=67.4GiB (72.4GB), run=60003-60003msec

Run status group 7 (all jobs):
   READ: bw=1337MiB/s (1402MB/s), 1337MiB/s-1337MiB/s (1402MB/s-1402MB/s), io=78.3GiB (84.1GB), run=60003-60003msec

Run status group 8 (all jobs):
   READ: bw=1554MiB/s (1630MB/s), 1554MiB/s-1554MiB/s (1630MB/s-1630MB/s), io=91.1GiB (97.8GB), run=60003-60003msec

Run status group 9 (all jobs):
   READ: bw=1779MiB/s (1866MB/s), 1779MiB/s-1779MiB/s (1866MB/s-1866MB/s), io=104GiB (112GB), run=60003-60003msec

Disk stats (read/write):
    dm-21: ios=8626735/0, merge=0/0, ticks=3576159/0, in_queue=3591715, util=99.75%, aggrios=2156691/0, aggrmerge=0/0, aggrticks=859614/0, aggrin_queue=859438, aggrutil=93.60%
  sddk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcd: ios=4313382/0, merge=0/0, ticks=1720484/0, in_queue=1720149, util=93.60%
  sdaw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdp: ios=4313383/0, merge=0/0, ticks=1717973/0, in_queue=1717604, util=93.54%
    dm-22: ios=9026450/0, merge=0/0, ticks=3560199/0, in_queue=3581555, util=99.85%, aggrios=2256620/0, aggrmerge=0/0, aggrticks=863629/0, aggrin_queue=863463, aggrutil=93.76%
  sdbb: ios=4513241/0, merge=0/0, ticks=1724675/0, in_queue=1724327, util=93.69%
  sdci: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdu: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddp: ios=4513241/0, merge=0/0, ticks=1729843/0, in_queue=1729525, util=93.76%
    dm-23: ios=8635767/0, merge=0/0, ticks=3573100/0, in_queue=3590407, util=99.77%, aggrios=2158948/0, aggrmerge=0/0, aggrticks=859136/0, aggrin_queue=858965, aggrutil=93.59%
  sddq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbc: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcj: ios=4317897/0, merge=0/0, ticks=1718913/0, in_queue=1718576, util=93.54%
  sdv: ios=4317898/0, merge=0/0, ticks=1717632/0, in_queue=1717286, util=93.59%
    dm-24: ios=8631524/0, merge=0/0, ticks=3577165/0, in_queue=3594916, util=99.81%, aggrios=2157886/0, aggrmerge=0/0, aggrticks=859464/0, aggrin_queue=859311, aggrutil=93.59%
  sdbk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcr: ios=4315773/0, merge=0/0, ticks=1719780/0, in_queue=1719493, util=93.56%
  sddy: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdad: ios=4315774/0, merge=0/0, ticks=1718079/0, in_queue=1717752, util=93.59%
    dm-25: ios=8631993/0, merge=0/0, ticks=3576022/0, in_queue=3591250, util=99.82%, aggrios=2158002/0, aggrmerge=0/0, aggrticks=859656/0, aggrin_queue=859489, aggrutil=93.64%
  sdab: ios=4316005/0, merge=0/0, ticks=1718907/0, in_queue=1718592, util=93.64%
  sdbi: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcp: ios=4316005/0, merge=0/0, ticks=1719719/0, in_queue=1719364, util=93.62%
  sddw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
    dm-26: ios=17273181/0, merge=0/0, ticks=3532531/0, in_queue=3550266, util=99.65%, aggrios=4318300/0, aggrmerge=0/0, aggrticks=825807/0, aggrin_queue=825490, aggrutil=91.83%
  sdcq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddx: ios=8636601/0, merge=0/0, ticks=1653007/0, in_queue=1652371, util=91.83%
  sdac: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbj: ios=8636601/0, merge=0/0, ticks=1650221/0, in_queue=1649590, util=91.80%
    dm-27: ios=17279724/0, merge=0/0, ticks=3535149/0, in_queue=3546678, util=99.62%, aggrios=4319933/0, aggrmerge=0/0, aggrticks=826034/0, aggrin_queue=825717, aggrutil=91.86%
  sddv: ios=8639867/0, merge=0/0, ticks=1653200/0, in_queue=1652546, util=91.86%
  sdaa: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbh: ios=8639868/0, merge=0/0, ticks=1650939/0, in_queue=1650322, util=91.85%
  sdco: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%